<a href="https://colab.research.google.com/github/JL-plusUltra/DataScience/blob/main/Indian_Food_Timeseries_SQL_mix.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from xgboost import XGBRegressor

In [ ]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [ ]:
orders = pd.read_csv('/content/restaurant-1-orders.csv')
#rename columns without spaces
orders.columns =['number', 'timestamp', 'item', 'quantity', 'price', 'total_products_in_cart']
orders.head(5)

   number         timestamp  ...  price  total_products_in_cart
0   16118  03/08/2019 20:25  ...   0.80                       6
1   16118  03/08/2019 20:25  ...  12.95                       6
2   16118  03/08/2019 20:25  ...   2.95                       6
3   16118  03/08/2019 20:25  ...   3.95                       6
4   16118  03/08/2019 20:25  ...   8.95                       6

[5 rows x 6 columns]

In [ ]:
orders['date'] =pd.to_datetime(orders['timestamp'].str[0:10])

In [ ]:
#install the ipython-sql libray
#!pip install ipython-sql

In [ ]:
#!pip install pandasql

In [ ]:
# import sql
import sqlite3

In [ ]:
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [ ]:
%sql sqlite:///jupyter_sql_tutorial.db

'Connected: @jupyter_sql_tutorial.db'

In [ ]:
%reload_ext sql

In [ ]:
orders.to_sql('food', cnn)
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
db_query='''
WITH distinct_orders AS (
    SELECT DISTINCT 
      number,
      DATE(date) AS date
      FROM food
)

SELECT
  date,
  COUNT(*) AS num_orders
FROM distinct_orders
GROUP BY 1
'''

In [ ]:
result = %sql $db_query

 * sqlite:///jupyter_sql_tutorial.db
Done.

In [ ]:
data2 = pd.read_sql('WITH distinct_orders AS (SELECT DISTINCT number, DATE(date) AS date FROM food) SELECT date, COUNT(*) AS num_orders FROM distinct_orders GROUP BY 1',con=cnn)

In [ ]:
data2

            date  num_orders
0     2015-01-09           1
1     2015-01-10           7
2     2015-02-10           5
3     2015-08-09           3
4     2015-09-09           6
...          ...         ...
1202  2019-12-03          11
1203  2019-12-04          25
1204  2019-12-05          23
1205  2019-12-06           9
1206  2019-12-07          18

[1207 rows x 2 columns]

In [ ]:
#data2.to_sql('Restfood.sql', con=cnn)

In [ ]:
#orders.to_sql('food.sql', con=cnn)

In [ ]:
orders.sample(10)

       number         timestamp  ... total_products_in_cart       date
62109    6247  02/08/2017 16:53  ...                      1 2017-02-08
43348   14091  30/03/2019 18:50  ...                      9 2019-03-30

[2 rows x 7 columns]

In [ ]:
print(f"Total number of orders: {orders['number'].nunique()}")

Total number of orders: 13397

In [ ]:
def load_query(path):
  with open(path) as file:
    return file.read()

In [ ]:
query = load_query('Restfood.sql')
daily_orders = pysqldf(query)

FileNotFoundError: ignored